Revit 2027 API
ReferenceBaseOnHostType Enumeration
 This enumeration is used to classify the Reference Base on Host type .
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ReferenceBaseOnHostType
Public Enumeration ReferenceBaseOnHostType
public enum class ReferenceBaseOnHostType
type ReferenceBaseOnHostType
Members
Member name | Value | Description
Midpoint | 2
PrimaryEnd | 0
SecondaryEnd | 1
See Also
Reference
Autodesk.Revit.DB Namespace